Revit 2026 API

# DesignToFabricationConverter Constructor

---

Creates a new instance of the DesignToFabricationConverter class.

**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DesignToFabricationConverter(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
DesignToFabricationConverter(
	Document^ document
)
```
```fsharp
new :
        document : Document -> DesignToFabricationConverter
```

#### Parameters

document Document
     A document in which to convert MEP design elements into fabrication parts.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DesignToFabricationConverter Class

Autodesk.Revit.DB.Fabrication Namespace